{
  "class_name": "Model",
  "keras_version": "2.1.2",
  "config": {
    "layers": [
      {
        "class_name": "InputLayer",
        "inbound_nodes": [],
        "config": {
          "dtype": "int32",
          "batch_input_shape": [
            null,
            136
          ],
          "name": "input_2",
          "sparse": false
        },
        "name": "input_2"
      },
      {
        "class_name": "Embedding",
        "inbound_nodes": [
          [
            [
              "input_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "config": {
          "embeddings_initializer": {
            "class_name": "RandomUniform",
            "config": {
              "maxval": 0.05,
              "seed": null,
              "minval": -0.05
            }
          },
          "name": "embedding_3",
          "dtype": "float32",
          "output_dim": 200,
          "trainable": true,
          "embeddings_regularizer": null,
          "input_dim": 37554,
          "mask_zero": false,
          "embeddings_constraint": null,
          "batch_input_shape": [
            null,
            136
          ],
          "activity_regularizer": null,
          "input_length": 136
        },
        "name": "embedding_3"
      },
      {
        "class_name": "Conv1D",
        "inbound_nodes": [
          [
            [
              "embedding_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "config": {
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "scale": 1.0,
              "seed": null,
              "mode": "fan_avg"
            }
          },
          "name": "conv1d_3",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "bias_constraint": null,
          "activation": "relu",
          "trainable": true,
          "padding": "valid",
          "strides": [
            1
          ],
          "dilation_rate": [
            1
          ],
          "kernel_regularizer": null,
          "filters": 3,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "use_bias": true,
          "activity_regularizer": null,
          "kernel_size": [
            5
          ]
        },
        "name": "conv1d_3"
      },
      {
        "class_name": "GlobalMaxPooling1D",
        "inbound_nodes": [
          [
            [
              "conv1d_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "config": {
          "trainable": true,
          "name": "global_max_pooling1d_3"
        },
        "name": "global_max_pooling1d_3"
      },
      {
        "class_name": "Dense",
        "inbound_nodes": [
          [
            [
              "global_max_pooling1d_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "config": {
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "scale": 1.0,
              "seed": null,
              "mode": "fan_avg"
            }
          },
          "name": "dense_3",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "bias_constraint": null,
          "activation": "softmax",
          "trainable": true,
          "kernel_regularizer": null,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "units": 20,
          "use_bias": true,
          "activity_regularizer": null
        },
        "name": "dense_3"
      }
    ],
    "input_layers": [
      [
        "input_2",
        0,
        0
      ]
    ],
    "name": "model_2",
    "output_layers": [
      [
        "dense_3",
        0,
        0
      ]
    ]
  },
  "backend": "tensorflow"
}