{"config": {"layers": [{"config": {"batch_input_shape": [null, 3], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"name": "embedding_1", "embeddings_regularizer": null, "batch_input_shape": [null, null], "embeddings_constraint": null, "activity_regularizer": null, "mask_zero": true, "input_length": null, "embeddings_initializer": {"config": {"seed": null, "minval": 0.01, "maxval": 0.05}, "class_name": "RandomUniform"}, "output_dim": 1, "trainable": true, "input_dim": 10, "dtype": "float32"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1", "class_name": "Embedding"}, {"config": {"kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "recurrent_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "minval": 0.01, "maxval": 0.05}, "class_name": "RandomUniform"}, "go_backwards": false, "trainable": true, "recurrent_dropout": 0.0, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "activation": "linear", "name": "lstm_1", "unit_forget_bias": true, "kernel_constraint": null, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "implementation": 1, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "minval": 0.01, "maxval": 0.05}, "class_name": "RandomUniform"}, "units": 1, "recurrent_activation": "linear"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "lstm_1", "class_name": "LSTM"}, {"config": {"activation": "relu", "name": "dense_1", "use_bias": false, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "units": 1, "kernel_constraint": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.2"}