{
 "class_name": "Sequential", 
 "keras_version": "2.0.6", 
 "config": [
  {
   "class_name": "Embedding", 
   "config": {
    "embeddings_initializer": {
     "class_name": "RandomUniform", 
     "config": {
      "maxval": 0.05, 
      "seed": null, 
      "minval": -0.05
     }
    }, 
    "name": "embedding_1", 
    "dtype": "float32", 
    "output_dim": 128, 
    "trainable": true, 
    "embeddings_regularizer": null, 
    "input_dim": 20000, 
    "mask_zero": false, 
    "embeddings_constraint": null, 
    "batch_input_shape": [
     null, 
     null
    ], 
    "activity_regularizer": null, 
    "input_length": null
   }
  }, 
  {
   "class_name": "LSTM", 
   "config": {
    "recurrent_activation": "hard_sigmoid", 
    "trainable": true, 
    "recurrent_initializer": {
     "class_name": "VarianceScaling",
     "config": {
      "distribution": "uniform",
      "scale": 1.0,
      "seed": null,
      "mode": "fan_avg"
     }
    }, 
    "use_bias": true, 
    "bias_regularizer": null, 
    "return_state": false, 
    "unroll": false, 
    "activation": "tanh", 
    "bias_initializer": {
     "class_name": "Zeros", 
     "config": {}
    }, 
    "units": 128, 
    "unit_forget_bias": true, 
    "activity_regularizer": null, 
    "recurrent_dropout": 0.0,
    "kernel_initializer": {
     "class_name": "VarianceScaling", 
     "config": {
      "distribution": "uniform", 
      "scale": 1.0, 
      "seed": null, 
      "mode": "fan_avg"
     }
    }, 
    "kernel_constraint": null, 
    "dropout": 0.2, 
    "stateful": false, 
    "recurrent_regularizer": null, 
    "name": "lstm_1", 
    "bias_constraint": null, 
    "go_backwards": false, 
    "implementation": 0, 
    "kernel_regularizer": null, 
    "return_sequences": false, 
    "recurrent_constraint": null
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "kernel_initializer": {
     "class_name": "VarianceScaling", 
     "config": {
      "distribution": "uniform", 
      "scale": 1.0, 
      "seed": null, 
      "mode": "fan_avg"
     }
    }, 
    "name": "dense_1", 
    "kernel_constraint": null, 
    "bias_regularizer": null, 
    "bias_constraint": null, 
    "activation": "sigmoid", 
    "trainable": true, 
    "kernel_regularizer": null, 
    "bias_initializer": {
     "class_name": "Zeros", 
     "config": {}
    }, 
    "units": 1, 
    "use_bias": true, 
    "activity_regularizer": null
   }
  }
 ], 
 "backend": "theano"
}
