{
  "class_name": "Sequential",
  "keras_version": "2.0.6",
  "config": [
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "dense_1",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "dtype": "float32",
        "activation": "linear",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 512,
        "batch_input_shape": [
          null,
          784
        ],
        "use_bias": true,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_1"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "rate": 0.2,
        "trainable": true,
        "name": "dropout_1"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "dense_2",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "dtype": "float32",
        "activation": "linear",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 512,
        "batch_input_shape": [
          null,
          512
        ],
        "use_bias": true,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_2"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "rate": 0.2,
        "trainable": true,
        "name": "dropout_2"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "dense_3",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "dtype": "float32",
        "activation": "linear",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 10,
        "batch_input_shape": [
          null,
          512
        ],
        "use_bias": true,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "softmax",
        "trainable": true,
        "name": "activation_3"
      }
    }
  ],
  "backend": "tensorflow"
}
