{
  "class_name": "Sequential",
  "keras_version": "2.0.6",
  "config": [
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "dense_1",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "dtype": "float32",
        "activation": "elu",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 3,
        "batch_input_shape": [
          null,
          4
        ],
        "use_bias": true,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_1"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "rate": 0.2,
        "trainable": true,
        "name": "dropout_1"
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_constraint": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "batchnormalization_1",
        "epsilon": 0.001,
        "trainable": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "scale": true,
        "axis": -1,
        "gamma_constraint": null,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "momentum": 0.99,
        "center": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "dense_2",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "dtype": "float32",
        "activation": "selu",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 2,
        "batch_input_shape": [
          null,
          null
        ],
        "use_bias": true,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "rate": 0.2,
        "trainable": true,
        "name": "dropout_2"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "dense_3",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "dtype": "float32",
        "activation": "linear",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 3,
        "batch_input_shape": [
          null,
          null
        ],
        "use_bias": true,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "softmax",
        "trainable": true,
        "name": "activation_2"
      }
    }
  ],
  "backend": "tensorflow"
}
