{
  "class_name": "Sequential",
  "keras_version": "2.0.8",
  "config": [
    {
      "class_name": "Embedding",
      "config": {
        "embeddings_initializer": {
          "class_name": "RandomUniform",
          "config": {
            "maxval": 0.05,
            "seed": null,
            "minval": -0.05
          }
        },
        "name": "embedding_1",
        "dtype": "float32",
        "output_dim": 128,
        "trainable": true,
        "embeddings_regularizer": null,
        "input_dim": 39,
        "mask_zero": false,
        "embeddings_constraint": null,
        "batch_input_shape": [
          null,
          63
        ],
        "activity_regularizer": null,
        "input_length": 63
      }
    },
    {
      "class_name": "Conv1D",
      "config": {
        "kernel_constraint": null,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "conv1d_1",
        "bias_regularizer": null,
        "bias_constraint": null,
        "activation": "relu",
        "trainable": true,
        "padding": "valid",
        "strides": [
          1
        ],
        "dilation_rate": [
          1
        ],
        "kernel_regularizer": null,
        "filters": 100,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "activity_regularizer": null,
        "kernel_size": [
          2
        ]
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "trainable": true,
        "name": "flatten_1"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "dense_1",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "activation": "relu",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 50,
        "use_bias": true,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "rate": 0.5,
        "trainable": true,
        "name": "dropout_1"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "dense_2",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "activation": "sigmoid",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 1,
        "use_bias": true,
        "activity_regularizer": null
      }
    }
  ],
  "backend": "tensorflow"
}
