{
  "class_name": "Sequential",
  "keras_version": "2.0.6",
  "config": [
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "convolution2d_1",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "dtype": "float32",
        "activation": "sigmoid",
        "trainable": true,
        "data_format": "channels_last",
        "filters": 2,
        "padding": "valid",
        "strides": [
          1,
          1
        ],
        "dilation_rate": [
          1,
          1
        ],
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "batch_input_shape": [
          null,
          8,
          8,
          3
        ],
        "use_bias": true,
        "activity_regularizer": null,
        "kernel_size": [
          3,
          2
        ]
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_constraint": null,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "convolution2d_2",
        "bias_regularizer": null,
        "bias_constraint": null,
        "activation": "linear",
        "trainable": true,
        "data_format": "channels_last",
        "padding": "valid",
        "strides": [
          1,
          1
        ],
        "dilation_rate": [
          1,
          1
        ],
        "kernel_regularizer": null,
        "filters": 1,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "activity_regularizer": null,
        "kernel_size": [
          2,
          3
        ]
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_1"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "maxpooling2d_1",
        "trainable": true,
        "data_format": "channels_last",
        "pool_size": [
          5,
          5
        ],
        "padding": "valid",
        "strides": [
          5,
          5
        ]
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "rate": 0.25,
        "trainable": true,
        "name": "dropout_1"
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "trainable": true,
        "name": "flatten_1"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "dense_1",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "dtype": "float32",
        "activation": "linear",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 2,
        "batch_input_shape": [
          null,
          null
        ],
        "use_bias": true,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_2"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "rate": 0.5,
        "trainable": true,
        "name": "dropout_2"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "dense_2",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "dtype": "float32",
        "activation": "softmax",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 3,
        "batch_input_shape": [
          null,
          null
        ],
        "use_bias": true,
        "activity_regularizer": null
      }
    }
  ],
  "backend": "tensorflow"
}
