{
  "class_name": "Model",
  "keras_version": "2.0.6",
  "config": {
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "dtype": "float32",
          "batch_input_shape": [
            null,
            4
          ],
          "name": "input1",
          "sparse": false
        },
        "inbound_nodes": [],
        "name": "input1"
      },
      {
        "class_name": "Dense",
        "config": {
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "scale": 1,
              "seed": null,
              "mode": "fan_avg"
            }
          },
          "name": "dense_1",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "bias_constraint": null,
          "dtype": "float32",
          "activation": "linear",
          "trainable": true,
          "kernel_regularizer": null,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "units": 3,
          "batch_input_shape": [
            null,
            null
          ],
          "use_bias": true,
          "activity_regularizer": null
        },
        "inbound_nodes": [
          [
            [
              "input1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dense_1"
      },
      {
        "class_name": "Activation",
        "config": {
          "activation": "relu",
          "trainable": true,
          "name": "activation_1"
        },
        "inbound_nodes": [
          [
            [
              "dense_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_1"
      },
      {
        "class_name": "Dropout",
        "config": {
          "rate": 0.2,
          "trainable": true,
          "name": "dropout_1"
        },
        "inbound_nodes": [
          [
            [
              "activation_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dropout_1"
      },
      {
        "class_name": "InputLayer",
        "config": {
          "dtype": "float32",
          "batch_input_shape": [
            null,
            4
          ],
          "name": "input2",
          "sparse": false
        },
        "inbound_nodes": [],
        "name": "input2"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_1",
          "concat_axis": -1,
          "mode_type": "raw",
          "dot_axes": -1,
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "mode": "concat",
          "output_shape": null,
          "output_shape_type": "raw"
        },
        "inbound_nodes": [
          [
            [
              "dropout_1",
              0,
              0,
              {}
            ],
            [
              "input2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "merge_1"
      },
      {
        "class_name": "Dense",
        "config": {
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "scale": 1,
              "seed": null,
              "mode": "fan_avg"
            }
          },
          "name": "dense_2",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "bias_constraint": null,
          "dtype": "float32",
          "activation": "tanh",
          "trainable": true,
          "kernel_regularizer": null,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "units": 2,
          "batch_input_shape": [
            null,
            null
          ],
          "use_bias": true,
          "activity_regularizer": null
        },
        "inbound_nodes": [
          [
            [
              "merge_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dense_2"
      },
      {
        "class_name": "Dropout",
        "config": {
          "rate": 0.2,
          "trainable": true,
          "name": "dropout_2"
        },
        "inbound_nodes": [
          [
            [
              "dense_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dropout_2"
      },
      {
        "class_name": "Dense",
        "config": {
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "scale": 1,
              "seed": null,
              "mode": "fan_avg"
            }
          },
          "name": "dense_3",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "bias_constraint": null,
          "dtype": "float32",
          "activation": "linear",
          "trainable": true,
          "kernel_regularizer": null,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "units": 3,
          "batch_input_shape": [
            null,
            null
          ],
          "use_bias": true,
          "activity_regularizer": null
        },
        "inbound_nodes": [
          [
            [
              "dropout_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dense_3"
      },
      {
        "class_name": "Activation",
        "config": {
          "activation": "sigmoid",
          "trainable": true,
          "name": "output1"
        },
        "inbound_nodes": [
          [
            [
              "dense_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "output1"
      },
      {
        "class_name": "Activation",
        "config": {
          "activation": "sigmoid",
          "trainable": true,
          "name": "output2"
        },
        "inbound_nodes": [
          [
            [
              "dense_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "output2"
      }
    ],
    "input_layers": [
      [
        "input1",
        0,
        0
      ],
      [
        "input2",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "output1",
        0,
        0
      ],
      [
        "output2",
        0,
        0
      ]
    ],
    "name": "model_1"
  },
  "backend": "tensorflow"
}
