{
  "class_name":"Sequential",
  "config":[
    {
      "class_name":"Dense",
      "config":{
        "name":"dense_80",
        "trainable":true,
        "batch_input_shape":[
          null,
          2,
          10
        ],
        "dtype":"float32",
        "units":64,
        "activation":"linear",
        "use_bias":true,
        "kernel_initializer":{
          "class_name":"VarianceScaling",
          "config":{
            "scale":1.0,
            "mode":"fan_avg",
            "distribution":"uniform",
            "seed":null
          }
        },
        "bias_initializer":{
          "class_name":"Zeros",
          "config":{

          }
        },
        "kernel_regularizer":{
          "class_name":"L1L2",
          "config":{
            "l1":0.0,
            "l2":0.009999999776482582
          }
        },
        "bias_regularizer":null,
        "activity_regularizer":null,
        "kernel_constraint":null,
        "bias_constraint":null
      }
    },
    {
      "class_name":"Activation",
      "config":{
        "name":"activation_69",
        "trainable":true,
        "activation":"softmax"
      }
    },
    {
      "class_name":"Dropout",
      "config":{
        "name":"dropout_34",
        "trainable":true,
        "rate":0.2
      }
    },
    {
      "class_name":"Dense",
      "config":{
        "name":"dense_81",
        "trainable":true,
        "units":64,
        "activation":"linear",
        "use_bias":true,
        "kernel_initializer":{
          "class_name":"VarianceScaling",
          "config":{
            "scale":1.0,
            "mode":"fan_avg",
            "distribution":"uniform",
            "seed":null
          }
        },
        "bias_initializer":{
          "class_name":"Zeros",
          "config":{

          }
        },
        "kernel_regularizer":null,
        "bias_regularizer":null,
        "activity_regularizer":null,
        "kernel_constraint":null,
        "bias_constraint":null
      }
    },
    {
      "class_name":"Flatten",
      "config":{
        "name":"flatten_34",
        "trainable":true
      }
    },
    {
      "class_name":"Dense",
      "config":{
        "name":"dense_82",
        "trainable":true,
        "units":1,
        "activation":"linear",
        "use_bias":true,
        "kernel_initializer":{
          "class_name":"VarianceScaling",
          "config":{
            "scale":1.0,
            "mode":"fan_avg",
            "distribution":"uniform",
            "seed":null
          }
        },
        "bias_initializer":{
          "class_name":"Zeros",
          "config":{

          }
        },
        "kernel_regularizer":null,
        "bias_regularizer":null,
        "activity_regularizer":null,
        "kernel_constraint":null,
        "bias_constraint":null
      }
    },
    {
      "class_name":"Activation",
      "config":{
        "name":"activation_70",
        "trainable":true,
        "activation":"relu"
      }
    }
  ],
  "keras_version":"2.0.8",
  "backend":"tensorflow"
}