{
 "class_name": "Sequential", 
 "keras_version": "2.0.6", 
 "config": [
  {
   "class_name": "Dense", 
   "config": {
    "kernel_initializer": {
     "class_name": "VarianceScaling", 
     "config": {
      "distribution": "uniform", 
      "scale": 1.0, 
      "seed": null, 
      "mode": "fan_avg"
     }
    }, 
    "name": "dense_1", 
    "kernel_constraint": {
     "class_name": "MaxNorm", 
     "config": {
      "max_value": 2.0, 
      "axis": 0
     }
    }, 
    "bias_regularizer": null, 
    "bias_constraint": null, 
    "dtype": "float32", 
    "activation": "relu", 
    "trainable": true, 
    "kernel_regularizer": null, 
    "bias_initializer": {
     "class_name": "Zeros", 
     "config": {}
    }, 
    "units": 512, 
    "batch_input_shape": [
     null, 
     784
    ], 
    "use_bias": true, 
    "activity_regularizer": null
   }
  }, 
  {
   "class_name": "Dropout", 
   "config": {
    "rate": 0.2, 
    "trainable": true, 
    "name": "dropout_1"
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "kernel_initializer": {
     "class_name": "VarianceScaling", 
     "config": {
      "distribution": "uniform", 
      "scale": 1.0, 
      "seed": null, 
      "mode": "fan_avg"
     }
    }, 
    "name": "dense_2", 
    "kernel_constraint": null, 
    "bias_regularizer": null, 
    "bias_constraint": {
     "class_name": "NonNeg", 
     "config": {}
    }, 
    "activation": "relu", 
    "trainable": true, 
    "kernel_regularizer": null, 
    "bias_initializer": {
     "class_name": "Zeros", 
     "config": {}
    }, 
    "units": 512, 
    "use_bias": true, 
    "activity_regularizer": null
   }
  }, 
  {
   "class_name": "Dropout", 
   "config": {
    "rate": 0.2, 
    "trainable": true, 
    "name": "dropout_2"
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "kernel_initializer": {
     "class_name": "VarianceScaling", 
     "config": {
      "distribution": "uniform", 
      "scale": 1.0, 
      "seed": null, 
      "mode": "fan_avg"
     }
    }, 
    "name": "dense_3", 
    "kernel_constraint": {
     "class_name": "UnitNorm", 
     "config": {
      "axis": 0
     }
    }, 
    "bias_regularizer": null, 
    "bias_constraint": null, 
    "activation": "relu", 
    "trainable": true, 
    "kernel_regularizer": null, 
    "bias_initializer": {
     "class_name": "Zeros", 
     "config": {}
    }, 
    "units": 512, 
    "use_bias": true, 
    "activity_regularizer": null
   }
  }, 
  {
   "class_name": "Dropout", 
   "config": {
    "rate": 0.2, 
    "trainable": true, 
    "name": "dropout_3"
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "kernel_initializer": {
     "class_name": "VarianceScaling", 
     "config": {
      "distribution": "uniform", 
      "scale": 1.0, 
      "seed": null, 
      "mode": "fan_avg"
     }
    }, 
    "name": "dense_4", 
    "kernel_constraint": null, 
    "bias_regularizer": null, 
    "bias_constraint": {
     "class_name": "MinMaxNorm", 
     "config": {
      "max_value": 1.0, 
      "rate": 1.0, 
      "min_value": 0.0, 
      "axis": 0
     }
    }, 
    "activation": "softmax", 
    "trainable": true, 
    "kernel_regularizer": null, 
    "bias_initializer": {
     "class_name": "Zeros", 
     "config": {}
    }, 
    "units": 10, 
    "use_bias": true, 
    "activity_regularizer": null
   }
  }
 ], 
 "backend": "tensorflow"
}
