{
  "loss": "categorical_crossentropy",
  "optimizer": {
    "nesterov": false,
    "lr": 0.009999999776482582,
    "name": "SGD",
    "momentum": 0,
    "decay": 0
  },
  "class_name": "Model",
  "loss_weights": null,
  "keras_version": "1.0.5",
  "config": {
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            1,
            48,
            48
          ],
          "name": "input_1",
          "input_dtype": "float32"
        },
        "inbound_nodes": [],
        "name": "input_1"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_1",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "th",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 32,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_1"
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "trainable": true,
          "name": "dropout_1"
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_1",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_1"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_2",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "th",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 32,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "dropout_1",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_2"
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "maxpooling2d_1",
          "trainable": true,
          "dim_ordering": "th",
          "pool_size": [
            2,
            2
          ],
          "strides": [
            2,
            2
          ],
          "border_mode": "valid"
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_2",
              0,
              0
            ]
          ]
        ],
        "name": "maxpooling2d_1"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_3",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "th",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "maxpooling2d_1",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_3"
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "trainable": true,
          "name": "dropout_2"
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_3",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_2"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_4",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "th",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "dropout_2",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_4"
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "maxpooling2d_2",
          "trainable": true,
          "dim_ordering": "th",
          "pool_size": [
            2,
            2
          ],
          "strides": [
            2,
            2
          ],
          "border_mode": "valid"
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_4",
              0,
              0
            ]
          ]
        ],
        "name": "maxpooling2d_2"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_5",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "th",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 128,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "maxpooling2d_2",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_5"
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "trainable": true,
          "name": "dropout_3"
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_5",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_3"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_6",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "th",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 128,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "dropout_3",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_6"
      },
      {
        "class_name": "UpSampling2D",
        "config": {
          "trainable": true,
          "name": "upsampling2d_1",
          "size": [
            2,
            2
          ]
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_6",
              0,
              0
            ]
          ]
        ],
        "name": "upsampling2d_1"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_1",
          "concat_axis": 1,
          "mode_type": "raw",
          "dot_axes": [
            -1,
            -1
          ],
          "mode": "concat",
          "output_shape": null,
          "output_shape_type": "raw"
        },
        "inbound_nodes": [
          [
            [
              "upsampling2d_1",
              0,
              0
            ],
            [
              "convolution2d_4",
              0,
              0
            ]
          ]
        ],
        "name": "merge_1"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_7",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "th",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "merge_1",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_7"
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "trainable": true,
          "name": "dropout_4"
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_7",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_4"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_8",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "th",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 64,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "dropout_4",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_8"
      },
      {
        "class_name": "UpSampling2D",
        "config": {
          "trainable": true,
          "name": "upsampling2d_2",
          "size": [
            2,
            2
          ]
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_8",
              0,
              0
            ]
          ]
        ],
        "name": "upsampling2d_2"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_2",
          "concat_axis": 1,
          "mode_type": "raw",
          "dot_axes": [
            -1,
            -1
          ],
          "mode": "concat",
          "output_shape": null,
          "output_shape_type": "raw"
        },
        "inbound_nodes": [
          [
            [
              "upsampling2d_2",
              0,
              0
            ],
            [
              "convolution2d_2",
              0,
              0
            ]
          ]
        ],
        "name": "merge_2"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_9",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "th",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 32,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "merge_2",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_9"
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "trainable": true,
          "name": "dropout_5"
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_9",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_5"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_10",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "th",
          "nb_col": 3,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 32,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 3
        },
        "inbound_nodes": [
          [
            [
              "dropout_5",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_10"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_11",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "th",
          "nb_col": 1,
          "subsample": [
            1,
            1
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 2,
          "border_mode": "same",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 1
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_10",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_11"
      },
      {
        "class_name": "Reshape",
        "config": {
          "target_shape": [
            2,
            2304
          ],
          "trainable": true,
          "name": "reshape_1"
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_11",
              0,
              0
            ]
          ]
        ],
        "name": "reshape_1"
      },
      {
        "class_name": "Permute",
        "config": {
          "dims": [
            2,
            1
          ],
          "trainable": true,
          "name": "permute_1"
        },
        "inbound_nodes": [
          [
            [
              "reshape_1",
              0,
              0
            ]
          ]
        ],
        "name": "permute_1"
      },
      {
        "class_name": "Activation",
        "config": {
          "activation": "softmax",
          "trainable": true,
          "name": "activation_1"
        },
        "inbound_nodes": [
          [
            [
              "permute_1",
              0,
              0
            ]
          ]
        ],
        "name": "activation_1"
      }
    ],
    "input_layers": [
      [
        "input_1",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "activation_1",
        0,
        0
      ]
    ],
    "name": "model_1"
  },
  "sample_weight_mode": null
}