{
 "class_name": "Sequential", 
 "keras_version": "2.0.8", 
 "config": [
  {
   "class_name": "SimpleRNN", 
   "config": {
    "dtype": "float32", 
    "trainable": true, 
    "recurrent_initializer": {
     "class_name": "VarianceScaling",
     "config": {
      "distribution": "uniform",
      "scale": 1.0,
      "seed": null,
      "mode": "fan_avg"
     }
    }, 
    "use_bias": true, 
    "bias_regularizer": null, 
    "return_state": false, 
    "unroll": false, 
    "activation": "tanh", 
    "bias_initializer": {
     "class_name": "Zeros", 
     "config": {}
    }, 
    "units": 50, 
    "batch_input_shape": [
     25, 
     1, 
     1
    ], 
    "activity_regularizer": null, 
    "recurrent_dropout": 0.0, 
    "kernel_initializer": {
     "class_name": "VarianceScaling", 
     "config": {
      "distribution": "uniform", 
      "scale": 1.0, 
      "seed": null, 
      "mode": "fan_avg"
     }
    }, 
    "kernel_constraint": null, 
    "dropout": 0.2, 
    "stateful": false, 
    "recurrent_regularizer": null, 
    "name": "simple_rnn_1", 
    "bias_constraint": null, 
    "go_backwards": false, 
    "implementation": 0, 
    "kernel_regularizer": null, 
    "return_sequences": true,
    "recurrent_constraint": null
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "kernel_initializer": {
     "class_name": "VarianceScaling", 
     "config": {
      "distribution": "uniform", 
      "scale": 1.0, 
      "seed": null, 
      "mode": "fan_avg"
     }
    }, 
    "name": "dense_1", 
    "kernel_constraint": null, 
    "bias_regularizer": null, 
    "bias_constraint": null, 
    "activation": "linear", 
    "trainable": true, 
    "kernel_regularizer": null, 
    "bias_initializer": {
     "class_name": "Zeros", 
     "config": {}
    }, 
    "units": 1, 
    "use_bias": true, 
    "activity_regularizer": null
   }
  }
 ], 
 "backend": "tensorflow"
}
