{
  "class_name": "Model",
  "keras_version": "2.1.5",
  "config": {
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "dtype": "float32",
          "batch_input_shape": [
            null,
            16
          ],
          "name": "input_3",
          "sparse": false
        },
        "inbound_nodes": [],
        "name": "input_3"
      },
      {
        "class_name": "InputLayer",
        "config": {
          "dtype": "float32",
          "batch_input_shape": [
            null,
            32
          ],
          "name": "input_4",
          "sparse": false
        },
        "inbound_nodes": [],
        "name": "input_4"
      },
      {
        "class_name": "Dense",
        "config": {
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "scale": 1,
              "seed": null,
              "mode": "fan_avg"
            }
          },
          "name": "dense_4",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "bias_constraint": null,
          "activation": "relu",
          "trainable": true,
          "kernel_regularizer": null,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "units": 8,
          "use_bias": true,
          "activity_regularizer": null
        },
        "inbound_nodes": [
          [
            [
              "input_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dense_4"
      },
      {
        "class_name": "Dense",
        "config": {
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "scale": 1,
              "seed": null,
              "mode": "fan_avg"
            }
          },
          "name": "dense_5",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "bias_constraint": null,
          "activation": "relu",
          "trainable": true,
          "kernel_regularizer": null,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "units": 8,
          "use_bias": true,
          "activity_regularizer": null
        },
        "inbound_nodes": [
          [
            [
              "input_4",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dense_5"
      },
      {
        "class_name": "Add",
        "config": {
          "trainable": true,
          "name": "add_2"
        },
        "inbound_nodes": [
          [
            [
              "dense_4",
              0,
              0,
              {}
            ],
            [
              "dense_5",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "add_2"
      },
      {
        "class_name": "Dense",
        "config": {
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "scale": 1,
              "seed": null,
              "mode": "fan_avg"
            }
          },
          "name": "dense_6",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "bias_constraint": null,
          "activation": "linear",
          "trainable": true,
          "kernel_regularizer": null,
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "units": 4,
          "use_bias": true,
          "activity_regularizer": null
        },
        "inbound_nodes": [
          [
            [
              "add_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dense_6"
      }
    ],
    "input_layers": [
      [
        "input_3",
        0,
        0
      ],
      [
        "input_4",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_6",
        0,
        0
      ]
    ],
    "name": "model_2"
  },
  "backend": "tensorflow"
}
