node {
  name: "random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\004\000\000\000\005\000\000\000"
      }
    }
  }
}
node {
  name: "random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 1
    }
  }
  attr {
    key: "seed2"
    value {
      i: 3
    }
  }
}
node {
  name: "random_uniform/sub"
  op: "Sub"
  input: "random_uniform/max"
  input: "random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "random_uniform/mul"
  op: "Mul"
  input: "random_uniform/RandomUniform"
  input: "random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "random_uniform"
  op: "Add"
  input: "random_uniform/mul"
  input: "random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "in_0"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 4
        }
        dim {
          size: 5
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "in_0/Assign"
  op: "Assign"
  input: "in_0"
  input: "random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@in_0"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "in_0/read"
  op: "Identity"
  input: "in_0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@in_0"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/range"
  op: "Range"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/range/start"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Rank"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/concat/values_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/concat"
  op: "ConcatV2"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/concat/values_0"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/range"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/transpose"
  op: "Transpose"
  input: "in_0/read"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/concat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/concat"
  op: "ConcatV2"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/Const"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/Const_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/zeros"
  op: "Fill"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/concat"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\004\000\000\000\001\000\000\000\005\000\000\000"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice"
  op: "StridedSlice"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Shape"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice/stack"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice/stack_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/concat_1/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/concat_1"
  op: "ConcatV2"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Const"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Const_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/concat_1/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/zeros"
  op: "Fill"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/concat_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/time"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray"
  op: "TensorArrayV3"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/dynamic_rnn/output_0"
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray_1"
  op: "TensorArrayV3"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 5
        }
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/dynamic_rnn/input_0"
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\004\000\000\000\001\000\000\000\005\000\000\000"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/strided_slice"
  op: "StridedSlice"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/Shape"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/strided_slice/stack"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/strided_slice/stack_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/range"
  op: "Range"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/range/start"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/strided_slice"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"
  op: "TensorArrayScatterV3"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/range"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/transpose"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/transpose"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Maximum/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Maximum"
  op: "Maximum"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Maximum/x"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Minimum"
  op: "Minimum"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Maximum"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/iteration_counter"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Enter"
  op: "Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/iteration_counter"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Enter_1"
  op: "Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/time"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Enter_2"
  op: "Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Enter_3"
  op: "Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/BasicRNNCellZeroState/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge"
  op: "Merge"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/NextIteration"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge_1"
  op: "Merge"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Enter_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/NextIteration_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge_2"
  op: "Merge"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Enter_2"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/NextIteration_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge_3"
  op: "Merge"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Enter_3"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/NextIteration_3"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Less"
  op: "Less"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Less/Enter"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Less/Enter"
  op: "Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Less_1"
  op: "Less"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Less_1/Enter"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Less_1/Enter"
  op: "Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/Minimum"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/LogicalAnd"
  op: "LogicalAnd"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Less"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Less_1"
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/LoopCond"
  op: "LoopCond"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/LogicalAnd"
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch"
  op: "Switch"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/LoopCond"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch_1"
  op: "Switch"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/LoopCond"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge_1"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch_2"
  op: "Switch"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge_2"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/LoopCond"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge_2"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch_3"
  op: "Switch"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge_3"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/LoopCond"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Merge_3"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity"
  op: "Identity"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity_1"
  op: "Identity"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch_1:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity_2"
  op: "Identity"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch_2:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity_3"
  op: "Identity"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch_3:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/add/y"
  op: "Const"
  input: "^stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/add"
  op: "AddV2"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/TensorArrayReadV3"
  op: "TensorArrayReadV3"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/TensorArrayReadV3/Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/TensorArrayReadV3/Enter_1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/TensorArrayReadV3/Enter"
  op: "Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray_1"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/TensorArrayReadV3/Enter_1"
  op: "Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\010\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.7385489344596863
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.7385489344596863
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 1
    }
  }
  attr {
    key: "seed2"
    value {
      i: 83
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/max"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/RandomUniform"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform"
  op: "Add"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/mul"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Assign"
  op: "Assign"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/read"
  op: "Identity"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/bias/Assign"
  op: "Assign"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/bias"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/bias/read"
  op: "Identity"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/concat/axis"
  op: "Const"
  input: "^stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/concat"
  op: "ConcatV2"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/TensorArrayReadV3"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity_3"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/MatMul"
  op: "MatMul"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/concat"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/MatMul/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/MatMul/Enter"
  op: "Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/BiasAdd"
  op: "BiasAdd"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/MatMul"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/BiasAdd/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/BiasAdd/Enter"
  op: "Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/basic_rnn_cell/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/Relu"
  op: "Relu"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/TensorArrayWrite/TensorArrayWriteV3"
  op: "TensorArrayWriteV3"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/TensorArrayWrite/TensorArrayWriteV3/Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/Relu"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/Relu"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/TensorArrayWrite/TensorArrayWriteV3/Enter"
  op: "Enter"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/Relu"
      }
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/add_1/y"
  op: "Const"
  input: "^stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/add_1"
  op: "AddV2"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Identity_1"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/NextIteration"
  op: "NextIteration"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/add"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/NextIteration_1"
  op: "NextIteration"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/add_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/NextIteration_2"
  op: "NextIteration"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/TensorArrayWrite/TensorArrayWriteV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/NextIteration_3"
  op: "NextIteration"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/basic_rnn_cell/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Exit"
  op: "Exit"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Exit_1"
  op: "Exit"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Exit_2"
  op: "Exit"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Exit_3"
  op: "Exit"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Switch_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayStack/TensorArraySizeV3"
  op: "TensorArraySizeV3"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Exit_2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray"
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayStack/range/start"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayStack/range/delta"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayStack/range"
  op: "Range"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayStack/range/start"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayStack/TensorArraySizeV3"
  input: "stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArrayStack/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/TensorArray"
      }
    }
  }
}
node {
