{
 "class_name": "Sequential",
 "keras_version": "1.1.2",
 "config": [
  {
   "class_name": "Convolution2D",
   "config": {
    "b_regularizer": null,
    "W_constraint": null,
    "b_constraint": null,
    "name": "convolution2d_1",
    "activity_regularizer": null,
    "trainable": true,
    "dim_ordering": "tf",
    "nb_col": 2,
    "subsample": [
     1,
     1
    ],
    "init": "glorot_uniform",
    "bias": true,
    "nb_filter": 2,
    "input_dtype": "float32",
    "border_mode": "valid",
    "batch_input_shape": [
     null,
     8,
     8,
     3
    ],
    "W_regularizer": null,
    "activation": "sigmoid",
    "nb_row": 3
   }
  },
  {
   "class_name": "Convolution2D",
   "config": {
    "W_constraint": null,
    "b_constraint": null,
    "name": "convolution2d_2",
    "activity_regularizer": null,
    "trainable": true,
    "dim_ordering": "tf",
    "nb_col": 3,
    "subsample": [
     1,
     1
    ],
    "init": "glorot_uniform",
    "bias": true,
    "nb_filter": 1,
    "border_mode": "valid",
    "b_regularizer": null, 
    "activation": "linear",
    "nb_row": 2
   }
  },
  {
   "class_name": "Activation",
   "config": {
    "activation": "relu",
    "trainable": true,
    "name": "activation_1"
   }
  },
  {
   "class_name": "MaxPooling2D",
   "config": {
    "name": "maxpooling2d_1",
    "trainable": true,
    "dim_ordering": "tf",
    "pool_size": [
     5,
     5
    ],
    "strides": [
     5,
     5
    ],
    "border_mode": "valid"
   }
  },
  {
   "class_name": "Dropout",
   "config": {
    "p": 0.25,
    "trainable": true,
    "name": "dropout_1"
   }
  },
  {
   "class_name": "Flatten",
   "config": {
    "trainable": true,
    "name": "flatten_1"
   }
  },
  {
   "class_name": "Dense",
   "config": {
    "W_constraint": null,
    "b_constraint": null,
    "name": "dense_1",
    "activity_regularizer": null,
    "trainable": true,
    "init": "glorot_uniform",
    "bias": true,
    "input_dim": null,
    "b_regularizer": null,
    "W_regularizer": null,
    "activation": "linear",
    "output_dim": 2
   }
  },
  {
   "class_name": "Activation",
   "config": {
    "activation": "relu",
    "trainable": true,
    "name": "activation_2"
   }
  },
  {
   "class_name": "Dropout",
   "config": {
    "p": 0.5,
    "trainable": true,
    "name": "dropout_2"
   }
  },
  {
   "class_name": "Dense",
   "config": {
    "W_constraint": null,
    "b_constraint": null,
    "name": "dense_2",
    "activity_regularizer": null,
    "trainable": true,
    "init": "glorot_uniform",
    "bias": true,
    "input_dim": null,
    "b_regularizer": null,
    "W_regularizer": null,
    "activation": "softmax",
    "output_dim": 3
   }
  }
 ]
}
