{
  "class_name": "Sequential",
  "keras_version": "1.2.2",
  "config": [
    {
      "class_name": "Embedding",
      "config": {
        "trainable": true,
        "name": "embedding_1",
        "activity_regularizer": null,
        "W_constraint": null,
        "init": "he_normal",
        "input_dtype": "int32",
        "mask_zero": false,
        "input_dim": 10000,
        "batch_input_shape": [
          null,
          100
        ],
        "W_regularizer": null,
        "dropout": 0,
        "output_dim": 100,
        "input_length": 100
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "W_constraint": null,
        "b_constraint": null,
        "name": "convolution1d_1",
        "activity_regularizer": null,
        "trainable": true,
        "filter_length": 3,
        "init": "glorot_uniform",
        "bias": true,
        "nb_filter": 1,
        "input_dim": null,
        "subsample_length": 1,
        "border_mode": "valid",
        "b_regularizer": null,
        "W_regularizer": null,
        "activation": "relu",
        "input_length": null
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "stride": 3,
        "pool_length": 3,
        "trainable": true,
        "name": "maxpooling1d_1",
        "border_mode": "valid"
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "W_constraint": null,
        "b_constraint": null,
        "name": "convolution1d_2",
        "activity_regularizer": null,
        "trainable": true,
        "filter_length": 3,
        "init": "glorot_uniform",
        "bias": true,
        "nb_filter": 1,
        "input_dim": null,
        "subsample_length": 1,
        "border_mode": "valid",
        "b_regularizer": null,
        "W_regularizer": null,
        "activation": "relu",
        "input_length": null
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "stride": 3,
        "pool_length": 3,
        "trainable": true,
        "name": "maxpooling1d_2",
        "border_mode": "valid"
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "trainable": true,
        "name": "flatten_1"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "W_constraint": null,
        "b_constraint": null,
        "name": "dense_1",
        "activity_regularizer": null,
        "trainable": true,
        "init": "glorot_uniform",
        "bias": true,
        "input_dim": 10,
        "b_regularizer": null,
        "W_regularizer": null,
        "activation": "sigmoid",
        "output_dim": 1
      }
    }
  ]
}
