{
 "class_name": "Sequential",
 "keras_version": "1.1.0",
 "config": [
  {
   "class_name": "LSTM",
   "config": {
    "inner_activation": "hard_sigmoid",
    "trainable": true,
    "inner_init": "glorot_uniform",
    "output_dim": 3,
    "unroll": false,
    "consume_less": "cpu",
    "init": "glorot_uniform",
    "dropout_U": 0.0,
    "input_dtype": "float32",
    "batch_input_shape": [
     null,
     10,
     2
    ],
    "input_length": 10,
    "dropout_W": 0.5,
    "activation": "tanh",
    "stateful": false,
    "b_regularizer": null,
    "U_regularizer": null,
    "name": "lstm_1",
    "go_backwards": false,
    "input_dim": 2,
    "return_sequences": true,
    "W_regularizer": null,
    "forget_bias_init": "one"
   }
  },
  {
   "class_name": "LSTM",
   "config": {
    "U_regularizer": null,
    "name": "lstm_2",
    "inner_activation": "hard_sigmoid",
    "go_backwards": false,
    "activation": "tanh",
    "trainable": true,
    "unroll": false,
    "consume_less": "cpu",
    "stateful": false,
    "init": "glorot_uniform",
    "inner_init": "glorot_uniform",
    "dropout_U": 0.0,
    "dropout_W": 0.0,
    "input_dim": 3,
    "return_sequences": true,
    "b_regularizer": null, 
    "output_dim": 2,
    "forget_bias_init": "one",
    "input_length": null
   }
  },
  {
   "class_name": "TimeDistributedDense",
   "config": {
    "input_length": null,
    "W_constraint": null,
    "b_constraint": null,
    "name": "timedistributeddense_1",
    "activity_regularizer": null,
    "trainable": true,
    "init": "glorot_uniform",
    "bias": true,
    "input_dim": null,
    "b_regularizer": null,
    "W_regularizer": null,
    "activation": "linear",
    "output_dim": 3
   }
  },
  {
   "class_name": "Activation",
   "config": {
    "activation": "softmax",
    "trainable": true,
    "name": "activation_1"
   }
  }
 ]
}
