{
 "class_name": "Model",
 "keras_version": "1.1.2",
 "config": {
  "layers": [
   {
    "class_name": "InputLayer",
    "config": {
     "batch_input_shape": [
      null,
      4
     ],
     "input_dtype": "float32",
     "sparse": false,
     "name": "input1"
    },
    "inbound_nodes": [],
    "name": "input1"
   },
   {
    "class_name": "InputLayer",
    "config": {
     "batch_input_shape": [
      null,
      4
     ],
     "input_dtype": "float32",
     "sparse": false,
     "name": "input2"
    },
    "inbound_nodes": [],
    "name": "input2"
   },
   {
    "class_name": "Merge",
    "config": {
     "name": "merge_1",
     "concat_axis": -1,
     "mode_type": "raw",
     "dot_axes": -1,
     "output_mask_type": "raw",
     "arguments": {},
     "output_mask": null,
     "mode": "concat",
     "output_shape": null,
     "output_shape_type": "raw"
    },
    "inbound_nodes": [
     [
      [
       "input1",
       0,
       0
      ],
      [
       "input2",
       0,
       0
      ]
     ]
    ],
    "name": "merge_1"
   },
   {
    "class_name": "Dense",
    "config": {
     "W_constraint": null,
     "b_constraint": null,
     "name": "dense_1",
     "activity_regularizer": null,
     "trainable": true,
     "init": "glorot_uniform",
     "bias": true,
     "input_dim": null,
     "b_regularizer": null, 
     "activation": "linear",
     "output_dim": 3
    },
    "inbound_nodes": [
     [
      [
       "merge_1",
       0,
       0
      ]
     ]
    ],
    "name": "dense_1"
   },
   {
    "class_name": "Activation",
    "config": {
     "activation": "relu",
     "trainable": true,
     "name": "activation_1"
    },
    "inbound_nodes": [
     [
      [
       "dense_1",
       0,
       0
      ]
     ]
    ],
    "name": "activation_1"
   },
   {
    "class_name": "Dropout",
    "config": {
     "p": 0.2,
     "trainable": true,
     "name": "dropout_1"
    },
    "inbound_nodes": [
     [
      [
       "activation_1",
       0,
       0
      ]
     ]
    ],
    "name": "dropout_1"
   },
   {
    "class_name": "Dense",
    "config": {
     "W_constraint": null,
     "b_constraint": null,
     "name": "dense_2",
     "activity_regularizer": null,
     "trainable": true,
     "init": "glorot_uniform",
     "bias": true,
     "input_dim": null,
     "b_regularizer": null,
     "W_regularizer": null,
     "activation": "tanh",
     "output_dim": 2
    },
    "inbound_nodes": [
     [
      [
       "dropout_1",
       0,
       0
      ]
     ]
    ],
    "name": "dense_2"
   },
   {
    "class_name": "Dropout",
    "config": {
     "p": 0.2,
     "trainable": true,
     "name": "dropout_2"
    },
    "inbound_nodes": [
     [
      [
       "dense_2",
       0,
       0
      ]
     ]
    ],
    "name": "dropout_2"
   },
   {
    "class_name": "Dense",
    "config": {
     "W_constraint": null,
     "b_constraint": null,
     "name": "dense_3",
     "activity_regularizer": null,
     "trainable": true,
     "init": "glorot_uniform",
     "bias": true,
     "input_dim": null,
     "b_regularizer": null,
     "W_regularizer": null,
     "activation": "linear",
     "output_dim": 3
    },
    "inbound_nodes": [
     [
      [
       "dropout_2",
       0,
       0
      ]
     ]
    ],
    "name": "dense_3"
   },
   {
    "class_name": "Activation",
    "config": {
     "activation": "softmax",
     "trainable": true,
     "name": "output1"
    },
    "inbound_nodes": [
     [
      [
       "dense_3",
       0,
       0
      ]
     ]
    ],
    "name": "output1"
   },
   {
    "class_name": "Activation",
    "config": {
     "activation": "sigmoid",
     "trainable": true,
     "name": "output2"
    },
    "inbound_nodes": [
     [
      [
       "dense_3",
       0,
       0
      ]
     ]
    ],
    "name": "output2"
   }
  ],
  "input_layers": [
   [
    "input1",
    0,
    0
   ],
   [
    "input2",
    0,
    0
   ]
  ],
  "output_layers": [
   [
    "output1",
    0,
    0
   ],
   [
    "output2",
    0,
    0
   ]
  ],
  "name": "model_1"
 }
}
