{
 "class_name": "Sequential",
 "keras_version": "1.1.2",
 "config": [
  {
   "class_name": "Dense",
   "config": {
    "W_constraint": null,
    "b_constraint": null,
    "name": "dense_1",
    "output_dim": 3,
    "activity_regularizer": null,
    "trainable": true,
    "init": "glorot_uniform",
    "bias": true,
    "input_dtype": "float32",
    "input_dim": null,
    "b_regularizer": null, 
    "activation": "linear",
    "batch_input_shape": [
     null,
     4
    ]
   }
  },
  {
   "class_name": "Activation",
   "config": {
    "activation": "relu",
    "trainable": true,
    "name": "activation_1"
   }
  },
  {
   "class_name": "Dropout",
   "config": {
    "p": 0.2,
    "trainable": true,
    "name": "dropout_1"
   }
  },
  {
   "class_name": "BatchNormalization",
   "config": {
    "gamma_regularizer": null,
    "name": "batchnormalization_1",
    "epsilon": 0.001,
    "trainable": true,
    "mode": 0,
    "beta_regularizer": null,
    "momentum": 0.99,
    "axis": -1
   }
  },
  {
   "class_name": "Dense",
   "config": {
    "W_constraint": null,
    "b_constraint": null,
    "name": "dense_2",
    "activity_regularizer": null,
    "trainable": true,
    "init": "glorot_uniform",
    "bias": true,
    "input_dim": null,
    "b_regularizer": null,
    "W_regularizer": null,
    "activation": "tanh",
    "output_dim": 2
   }
  },
  {
   "class_name": "Dropout",
   "config": {
    "p": 0.2,
    "trainable": true,
    "name": "dropout_2"
   }
  },
  {
   "class_name": "Dense",
   "config": {
    "W_constraint": null,
    "b_constraint": null,
    "name": "dense_3",
    "activity_regularizer": null,
    "trainable": true,
    "init": "glorot_uniform",
    "bias": true,
    "input_dim": null,
    "b_regularizer": null,
    "W_regularizer": null,
    "activation": "linear",
    "output_dim": 3
   }
  },
  {
   "class_name": "Activation",
   "config": {
    "activation": "softmax",
    "trainable": true,
    "name": "activation_2"
   }
  }
 ]
}
