{
 "class_name": "Sequential", 
 "keras_version": "1.2.2", 
 "config": [
  {
   "class_name": "Convolution2D", 
   "config": {
    "b_regularizer": null, 
    "W_constraint": null, 
    "b_constraint": null, 
    "name": "convolution2d_1", 
    "activity_regularizer": null, 
    "trainable": true, 
    "dim_ordering": "th", 
    "nb_col": 3, 
    "subsample": [
     1, 
     1
    ], 
    "init": "glorot_uniform", 
    "bias": true, 
    "nb_filter": 32, 
    "input_dtype": "float32", 
    "border_mode": "valid", 
    "batch_input_shape": [
     null, 
     1, 
     28, 
     28
    ], 
    "W_regularizer": null, 
    "activation": "linear", 
    "nb_row": 3
   }
  }, 
  {
   "class_name": "Activation", 
   "config": {
    "activation": "relu", 
    "trainable": true, 
    "name": "activation_1"
   }
  }, 
  {
   "class_name": "Convolution2D", 
   "config": {
    "W_constraint": null, 
    "b_constraint": null, 
    "name": "convolution2d_2", 
    "activity_regularizer": null, 
    "trainable": true, 
    "dim_ordering": "th", 
    "nb_col": 3, 
    "subsample": [
     1, 
     1
    ], 
    "init": "glorot_uniform", 
    "bias": true, 
    "nb_filter": 32, 
    "border_mode": "valid", 
    "b_regularizer": null, 
    "W_regularizer": null, 
    "activation": "linear", 
    "nb_row": 3
   }
  }, 
  {
   "class_name": "Activation", 
   "config": {
    "activation": "relu", 
    "trainable": true, 
    "name": "activation_2"
   }
  }, 
  {
   "class_name": "MaxPooling2D", 
   "config": {
    "name": "maxpooling2d_1", 
    "trainable": true, 
    "dim_ordering": "th", 
    "pool_size": [
     2, 
     2
    ], 
    "strides": [
     2, 
     2
    ], 
    "border_mode": "valid"
   }
  }, 
  {
   "class_name": "Dropout", 
   "config": {
    "p": 0.25, 
    "trainable": true, 
    "name": "dropout_1"
   }
  }, 
  {
   "class_name": "Flatten", 
   "config": {
    "trainable": true, 
    "name": "flatten_1"
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "W_constraint": null, 
    "b_constraint": null, 
    "name": "dense_1", 
    "activity_regularizer": null, 
    "trainable": true, 
    "init": "glorot_uniform", 
    "bias": true, 
    "input_dim": 4608, 
    "b_regularizer": null, 
    "W_regularizer": null, 
    "activation": "linear", 
    "output_dim": 128
   }
  }, 
  {
   "class_name": "Activation", 
   "config": {
    "activation": "relu", 
    "trainable": true, 
    "name": "activation_3"
   }
  }, 
  {
   "class_name": "Dropout", 
   "config": {
    "p": 0.5, 
    "trainable": true, 
    "name": "dropout_2"
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "W_constraint": null, 
    "b_constraint": null, 
    "name": "dense_2", 
    "activity_regularizer": null, 
    "trainable": true, 
    "init": "glorot_uniform", 
    "bias": true, 
    "input_dim": 128, 
    "b_regularizer": null, 
    "W_regularizer": null, 
    "activation": "linear", 
    "output_dim": 10
   }
  }, 
  {
   "class_name": "Activation", 
   "config": {
    "activation": "softmax", 
    "trainable": true, 
    "name": "activation_4"
   }
  }
 ]
}
