{
 "class_name": "Sequential", 
 "keras_version": "1.2.2", 
 "config": [
  {
   "class_name": "Dense", 
   "config": {
    "W_constraint": null, 
    "b_constraint": null, 
    "name": "dense_1", 
    "output_dim": 512, 
    "activity_regularizer": null, 
    "trainable": true, 
    "init": "glorot_uniform", 
    "bias": true, 
    "input_dtype": "float32", 
    "input_dim": 784, 
    "b_regularizer": null, 
    "W_regularizer": null, 
    "activation": "linear", 
    "batch_input_shape": [
     null, 
     784
    ]
   }
  }, 
  {
   "class_name": "LeakyReLU", 
   "config": {
    "alpha": 0.3, 
    "trainable": true, 
    "name": "leakyrelu_1"
   }
  }, 
  {
   "class_name": "Dropout", 
   "config": {
    "p": 0.2, 
    "trainable": true, 
    "name": "dropout_1"
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "W_constraint": null, 
    "b_constraint": null, 
    "name": "dense_2", 
    "activity_regularizer": null, 
    "trainable": true, 
    "init": "glorot_uniform", 
    "bias": true, 
    "input_dim": 512, 
    "b_regularizer": null, 
    "W_regularizer": null, 
    "activation": "linear", 
    "output_dim": 512
   }
  }, 
  {
   "class_name": "Activation", 
   "config": {
    "activation": "relu", 
    "trainable": true, 
    "name": "activation_1"
   }
  }, 
  {
   "class_name": "Dropout", 
   "config": {
    "p": 0.2, 
    "trainable": true, 
    "name": "dropout_2"
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "W_constraint": null, 
    "b_constraint": null, 
    "name": "dense_3", 
    "activity_regularizer": null, 
    "trainable": true, 
    "init": "glorot_uniform", 
    "bias": true, 
    "input_dim": 512, 
    "b_regularizer": null, 
    "W_regularizer": null, 
    "activation": "linear", 
    "output_dim": 10
   }
  }, 
  {
   "class_name": "Activation", 
   "config": {
    "activation": "softmax", 
    "trainable": true, 
    "name": "activation_2"
   }
  }
 ]
}
