{
 "class_name": "Sequential", 
 "keras_version": "1.2.2", 
 "config": [
  {
   "class_name": "Dense", 
   "config": {
    "W_constraint": {
     "m": 2.0, 
     "name": "MaxNorm", 
     "axis": 0
    }, 
    "b_constraint": null, 
    "name": "dense_1", 
    "output_dim": 512, 
    "activity_regularizer": null, 
    "trainable": true, 
    "init": "glorot_uniform", 
    "bias": true, 
    "input_dtype": "float32", 
    "input_dim": 784, 
    "b_regularizer": null, 
    "W_regularizer": null, 
    "activation": "relu", 
    "batch_input_shape": [
     null, 
     784
    ]
   }
  }, 
  {
   "class_name": "Dropout", 
   "config": {
    "p": 0.2, 
    "trainable": true, 
    "name": "dropout_1"
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "W_constraint": null, 
    "b_constraint": {
     "name": "NonNeg"
    }, 
    "name": "dense_2", 
    "activity_regularizer": null, 
    "trainable": true, 
    "init": "glorot_uniform", 
    "bias": true, 
    "input_dim": 512, 
    "b_regularizer": null, 
    "W_regularizer": null, 
    "activation": "relu", 
    "output_dim": 512
   }
  }, 
  {
   "class_name": "Dropout", 
   "config": {
    "p": 0.2, 
    "trainable": true, 
    "name": "dropout_2"
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "W_constraint": {
     "name": "UnitNorm", 
     "axis": 0
    }, 
    "b_constraint": null, 
    "name": "dense_3", 
    "activity_regularizer": null, 
    "trainable": true, 
    "init": "glorot_uniform", 
    "bias": true, 
    "input_dim": 512, 
    "b_regularizer": null, 
    "W_regularizer": null, 
    "activation": "relu", 
    "output_dim": 512
   }
  }, 
  {
   "class_name": "Dropout", 
   "config": {
    "p": 0.2, 
    "trainable": true, 
    "name": "dropout_3"
   }
  }, 
  {
   "class_name": "Dense", 
   "config": {
    "W_constraint": null, 
    "b_constraint": {
     "high": 1.0, 
     "rate": 1.0, 
     "low": 0.0, 
     "name": "MinMaxNorm", 
     "axis": 0
    }, 
    "name": "dense_4", 
    "activity_regularizer": null, 
    "trainable": true, 
    "init": "glorot_uniform", 
    "bias": true, 
    "input_dim": 512, 
    "b_regularizer": null, 
    "W_regularizer": null, 
    "activation": "softmax", 
    "output_dim": 10
   }
  }
 ]
}
