{
  "keras_version": "1.2.0",
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Convolution2D",
      "config": {
        "dim_ordering": "th",
        "nb_row": 3,
        "name": "convolution2d_1",
        "b_regularizer": null,
        "nb_col": 3,
        "bias": true,
        "activation": "linear",
        "nb_filter": 16,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "input_dtype": "float32",
        "border_mode": "same",
        "batch_input_shape": [
          null,
          3,
          448,
          448
        ],
        "W_regularizer": null,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.1,
        "name": "leakyrelu_1",
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "dim_ordering": "th",
        "name": "maxpooling2d_1",
        "strides": [
          2,
          2
        ],
        "pool_size": [
          2,
          2
        ],
        "border_mode": "valid",
        "trainable": true
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "dim_ordering": "th",
        "nb_row": 3,
        "name": "convolution2d_2",
        "b_regularizer": null,
        "nb_col": 3,
        "bias": true,
        "activation": "linear",
        "nb_filter": 32,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "border_mode": "same",
        "W_regularizer": null,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.1,
        "name": "leakyrelu_2",
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "dim_ordering": "th",
        "name": "maxpooling2d_2",
        "strides": [
          2,
          2
        ],
        "pool_size": [
          2,
          2
        ],
        "border_mode": "valid",
        "trainable": true
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "dim_ordering": "th",
        "nb_row": 3,
        "name": "convolution2d_3",
        "b_regularizer": null,
        "nb_col": 3,
        "bias": true,
        "activation": "linear",
        "nb_filter": 64,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "border_mode": "same",
        "W_regularizer": null,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.1,
        "name": "leakyrelu_3",
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "dim_ordering": "th",
        "name": "maxpooling2d_3",
        "strides": [
          2,
          2
        ],
        "pool_size": [
          2,
          2
        ],
        "border_mode": "valid",
        "trainable": true
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "dim_ordering": "th",
        "nb_row": 3,
        "name": "convolution2d_4",
        "b_regularizer": null,
        "nb_col": 3,
        "bias": true,
        "activation": "linear",
        "nb_filter": 128,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "border_mode": "same",
        "W_regularizer": null,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.1,
        "name": "leakyrelu_4",
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "dim_ordering": "th",
        "name": "maxpooling2d_4",
        "strides": [
          2,
          2
        ],
        "pool_size": [
          2,
          2
        ],
        "border_mode": "valid",
        "trainable": true
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "dim_ordering": "th",
        "nb_row": 3,
        "name": "convolution2d_5",
        "b_regularizer": null,
        "nb_col": 3,
        "bias": true,
        "activation": "linear",
        "nb_filter": 256,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "border_mode": "same",
        "W_regularizer": null,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.1,
        "name": "leakyrelu_5",
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "dim_ordering": "th",
        "name": "maxpooling2d_5",
        "strides": [
          2,
          2
        ],
        "pool_size": [
          2,
          2
        ],
        "border_mode": "valid",
        "trainable": true
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "dim_ordering": "th",
        "nb_row": 3,
        "name": "convolution2d_6",
        "b_regularizer": null,
        "nb_col": 3,
        "bias": true,
        "activation": "linear",
        "nb_filter": 512,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "border_mode": "same",
        "W_regularizer": null,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.1,
        "name": "leakyrelu_6",
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "dim_ordering": "th",
        "name": "maxpooling2d_6",
        "strides": [
          2,
          2
        ],
        "pool_size": [
          2,
          2
        ],
        "border_mode": "valid",
        "trainable": true
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "dim_ordering": "th",
        "nb_row": 3,
        "name": "convolution2d_7",
        "b_regularizer": null,
        "nb_col": 3,
        "bias": true,
        "activation": "linear",
        "nb_filter": 1024,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "border_mode": "same",
        "W_regularizer": null,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.1,
        "name": "leakyrelu_7",
        "trainable": true
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "dim_ordering": "th",
        "nb_row": 3,
        "name": "convolution2d_8",
        "b_regularizer": null,
        "nb_col": 3,
        "bias": true,
        "activation": "linear",
        "nb_filter": 1024,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "border_mode": "same",
        "W_regularizer": null,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.1,
        "name": "leakyrelu_8",
        "trainable": true
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "dim_ordering": "th",
        "nb_row": 3,
        "name": "convolution2d_9",
        "b_regularizer": null,
        "nb_col": 3,
        "bias": true,
        "activation": "linear",
        "nb_filter": 1024,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "border_mode": "same",
        "W_regularizer": null,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.1,
        "name": "leakyrelu_9",
        "trainable": true
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten_1",
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "trainable": true,
        "activation": "linear",
        "input_dim": 50176,
        "bias": true,
        "output_dim": 256,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "name": "dense_1",
        "W_regularizer": null,
        "b_regularizer": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "trainable": true,
        "activation": "linear",
        "input_dim": 256,
        "bias": true,
        "output_dim": 4096,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "name": "dense_2",
        "W_regularizer": null,
        "b_regularizer": null
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.1,
        "name": "leakyrelu_10",
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "trainable": true,
        "activation": "linear",
        "input_dim": 4096,
        "bias": true,
        "output_dim": 1470,
        "activity_regularizer": null,
        "b_constraint": null,
        "W_constraint": null,
        "init": "glorot_uniform",
        "name": "dense_3",
        "W_regularizer": null,
        "b_regularizer": null
      }
    }
  ]
}
